Revit 2024 API
StructuralConnectionHandlerType.IsDetailed Method
 Checks if StructuralConnectionHandlerType is detailed.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public bool IsDetailed()
Visual Basic
Public Function IsDetailed As Boolean
Visual C++
public:
bool IsDetailed()
Return Value
 True if StructuralConnectionHandlerType is detailed.
See Also
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace